snlkuharlocal/src/DataProcessors/АРМ_ЗакрытиеМинусов/АРМ_ЗакрытиеМинусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМ_ЗакрытиеМинусов</name>
  <attributes>
    <name>ФизическийСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыСПроблемнойДатойВременем</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеДокумента</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВиртуальныеПРМкУдалению</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПеремещениеДляОбнуленияВиртуальныхСкладов</name>
    <attributes>
      <name>ВиртуальныйСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПеремещенияНаВиртуальныеСклады</name>
    <attributes>
      <name>ВиртуальныйСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПеремещенияСВиртуальныхСкладов</name>
    <attributes>
      <name>ВиртуальныйСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработанныеДни</name>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинусаЗакрыты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзлишкиЗабраны</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньОбработан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ВидСклада/ВидСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСклада</name>
  <enumValues>
    <name>Физический</name>
  </enumValues>
  <enumValues>
    <name>Виртуальный</name>
  </enumValues>
  <enumValues>
    <name>ВиртуальныйДляСклада</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Календарь/Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Календарь</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Дни</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныйДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаВВыходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/АРМ_ЗакрытиеМинусов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрываемыйМесяц = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	СмещениеПоДате = 10; 
	ВыполнятьФоново = Истина;
КонецПроцедуры

&НаСервере
Процедура ПроверитьДатуВремяДокументовНаСервере()
	Дата1 = НачалоМесяца(ЗакрываемыйМесяц);
	Дата2 = НачалоМесяца(ЗакрываемыйМесяц)+СмещениеПоДате-1;
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	Док.Ссылка КАК Документ,
	|	ИСТИНА КАК Отметка,
	|	Док.СостояниеНакладной КАК СостояниеДокумента
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И Док.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена)   
	|	И (Док.Склад.ФизическийСклад = &ФизическийСклад или Док.Склад  = &ФизическийСклад)
	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка,
	|	ИСТИНА,
	|	Док.СостояниеНакладной
	|ИЗ
	|	Документ.Перемещение КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И Док.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена)
	|	И Док.СостояниеНакладнойУПолучателя = ЗНАЧЕНИЕ(перечисление.состояниянакладной.Принята)
	|	И (Док.Склад.ФизическийСклад = &ФизическийСклад или Док.Склад  = &ФизическийСклад)
	|	И не (Док.СкладПолучатель.ФизическийСклад = &ФизическийСклад или Док.СкладПолучатель  = &ФизическийСклад)";; 
	запрос.УстановитьПараметр("Дата1",Дата1);
	запрос.УстановитьПараметр("Дата2",Дата2);      
	запрос.УстановитьПараметр("СмещениеПоДате", СмещениеПоДате);     
	запрос.УстановитьПараметр("ФизическийСклад",Объект.ФизическийСклад);
	объект.ДокументыСПроблемнойДатойВременем.Загрузить(запрос.Выполнить().Выгрузить());        
	если объект.ДокументыСПроблемнойДатойВременем.Количество() = 0 тогда  
		ВремяДокументовПеренесено = Истина;
	Иначе       
		ВремяДокументовПеренесено = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДатуВремяОтгруженныхДокументов(Команда)  
	если не ЗначениеЗаполнено(ЗакрываемыйМесяц) тогда     
		Сообщить("Укажите закрываемый месяц");
		Возврат;
	КонецЕсли;     
	если не ЗначениеЗаполнено(объект.ФизическийСклад) тогда     
		Сообщить("Укажите физический склад");
		Возврат;
	КонецЕсли;     
	
	
	ПроверитьДатуВремяДокументовНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВремяДокументов(Команда)    
	
	если не ЗначениеЗаполнено(ЗакрываемыйМесяц) тогда     
		Сообщить("Укажите закрываемый месяц");
		Возврат;
	КонецЕсли;
	
	
	
	ПроцентВыполненияПереносВремени = 0;  
	МассивСтрок = новый Массив; 
	для каждого СтрТЧ из объект.ДокументыСПроблемнойДатойВременем цикл  
		если СтрТЧ.Отметка тогда
			МассивСтрок.Добавить(СтрТЧ.Документ);     
		КонецЕсли;
	КонецЦикла;     
	
	
	ПараметрыПроцедуры = новый Массив;          
	ПараметрыПроцедуры.Добавить(МассивСтрок);
	ПараметрыПроцедуры.Добавить(СмещениеПоДате);
	если ВыполнятьФоново тогда	
		пВыполнения 		= инт_ДлительныеОперации.ПараметрыВыполненияВФоне();			
		КоличествоПотоков	= 1;				
		рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработки.АРМ_ЗакрытиеМинусов.ПеренестиВремяИсходящихНакладных", ПараметрыПроцедуры, пВыполнения);			
		
		Обработчик = новый ОписаниеОповещения("ПолучитьРезультатВыполненияПереносВремениДокуметов",ЭтотОбъект);  
		УведомленияКлиента.ПодключитьОбработчик("ПроцентВыполненияПереносВремениДокументов",Обработчик);    
		
		Обработчик = новый ОписаниеОповещения("ПолучитьОповещенияФоновыеПереносВремениДокументов",ЭтотОбъект);  	
		УведомленияКлиента.ПодключитьОбработчик("ОповещенияФоновыеПереносВремениДокументов",Обработчик);    
	иначе                                   
		ДопПараметры = новый Структура("ВыполнятьФоново",Ложь);
		ПеренестиВремяДокументовНаСервере(МассивСтрок,СмещениеПоДате,ДопПараметры);   
		ПроверитьДатуВремяДокументовНаСервере();

	КонецЕсли;
	
	
КонецПроцедуры





&НаСервере
Процедура ЗаполнитьУдаляемыеВиртуальныеПРМНаСервере() 
	
	ПроверитьЗаписьОстатковСкладаНаСервере();
	если не ОстаткиВиртуальныхСкладовНаКонецМесяцаЗафиксированы	тогда
		сообщение = новый СообщениеПользователю;
		сообщение.Текст = "не записаны остатки на конец месяца. Выполнение отменено";       
		сообщение.Сообщить();
		возврат;
	КонецЕсли;  
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	Перемещение.Ссылка КАК Документ,
	|	Перемещение.Склад КАК Склад,     
	|	Истина КАК Отметка,	
	|	Перемещение.СкладПолучатель КАК СкладПолучатель,
	|	Перемещение.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.Перемещение КАК Перемещение
	|ГДЕ
	|	Перемещение.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Перемещение.Проведен
	|	И Перемещение.СостояниеНакладной = ЗНАЧЕНИЕ(перечисление.состояниянакладной.Отгружена)     
	|	И не Перемещение.Комментарий подобно ""Создано обработкой закрытия минусов.%""
	//|	И Перемещение.СостояниеНакладнойУПолучателя = ЗНАЧЕНИЕ(перечисление.состояниянакладной.Принята)  
	//Отсев С чужих физических
	|	И НЕ(Перемещение.Склад.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)  
	|				И Перемещение.Склад <> &ФизическийСклад)      
	//Отсев На чужие физические
	|	И НЕ(Перемещение.СкладПолучатель.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
	|				И Перемещение.СкладПолучатель <> &ФизическийСклад)    
	//Отсев С чужих виртуальных
	|	И НЕ(Перемещение.Склад.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|				И Перемещение.Склад.ФизическийСклад <> &ФизическийСклад)    
	//Отсев На чужие виртуальные
	|	И НЕ(Перемещение.СкладПолучатель.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|				И Перемещение.СкладПолучатель.ФизическийСклад <> &ФизическийСклад)  
	// оставим только с нужных виртуальных
	|	И (Перемещение.Склад.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|				И Перемещение.Склад.ФизическийСклад = &ФизическийСклад    
	// или только на нужных виртуальных
	|			ИЛИ Перемещение.СкладПолучатель.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|				И Перемещение.СкладПолучатель.ФизическийСклад = &ФизическийСклад)";    
	запрос.УстановитьПараметр("Дата1",НачалоМесяца(ЗакрываемыйМесяц));
	запрос.УстановитьПараметр("Дата2",КонецМесяца(ЗакрываемыйМесяц));
	запрос.УстановитьПараметр("ФизическийСклад",Объект.ФизическийСклад);       
	Объект.ВиртуальныеПРМкУдалению.Загрузить(запрос.Выполнить().Выгрузить());	
	
	если Объект.ВиртуальныеПРМкУдалению.Количество() = 0 тогда 
		ВиртуальныеПРМРаспроведены = Истина;
	иначе
		ВиртуальныеПРМРаспроведены = ложь;	
	КонецЕсли;    
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУдаляемыеВиртуальныеПРМ(Команда)   
	если не ЗначениеЗаполнено(ЗакрываемыйМесяц) тогда     
		Сообщить("Укажите закрываемый месяц");
		Возврат;
	КонецЕсли;
	
	
	если не ЗначениеЗаполнено(объект.ФизическийСклад) тогда
		Сообщить("Заполните физический склад");      
		возврат;
	КонецЕсли;
	
	если не ВремяДокументовПеренесено тогда
		Сообщить("Вернитесь на вкладку - Проверить дату время отгруженных документов и проверьте что отсутствуют документы, у которых нужно переносить дату.");
		Возврат;
	КонецЕсли;     
	
	
	ЗаписатьНеЗаписанныеОстаткиОткрытогоПериода(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц));
	
	ПроверитьЗаписьОстатковСкладаНаСервере();	
	ЗаполнитьУдаляемыеВиртуальныеПРМНаСервере();
	
КонецПроцедуры    

&НаСервере
Процедура ЗаписатьНеЗаписанныеОстаткиОткрытогоПериода (Склад,Месяц)  
	если не Обработки.АРМ_ЗакрытиеМинусов.ОстаткиСкладовЗаписаны (Склад,Месяц) тогда
		Обработки.АРМ_ЗакрытиеМинусов.ЗаписатьОстаткиСклада(Склад,Месяц);  
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура РаспровестиВыбранныеПРМ(Команда) 
	если не ЗначениеЗаполнено(ЗакрываемыйМесяц) тогда     
		Сообщить("Укажите закрываемый месяц");
		Возврат;
	КонецЕсли;      
	
	если не ЗначениеЗаполнено(Объект.ФизическийСклад) тогда     
		Сообщить("Укажите закрываемый физ. склад");
		Возврат;
	КонецЕсли;
	
	//         		УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияРаспровестиВиртуальныеПРМ",100);
	//УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеРаспровестиВиртуальныеПРМ",СтрСоединить(МассивСообщений,символы.ПС));  
	
	
	ПроверитьЗаписьОстатковСкладаНаСервере();
	если не ОстаткиВиртуальныхСкладовНаКонецМесяцаЗафиксированы	тогда
		сообщение = новый СообщениеПользователю;
		сообщение.Текст = "не записаны остатки на конец месяца. Выполнение отменено";       
		сообщение.Сообщить();
		возврат;
	КонецЕсли;  
	
	
	ПроцентСборкаТовараНаФизСкладе = 0;  
	МассивСтрок = новый Массив; 
	для каждого СтрТЧ из объект.ВиртуальныеПРМкУдалению цикл  
		если СтрТЧ.Отметка тогда
			МассивСтрок.Добавить(СтрТЧ.Документ);     
		КонецЕсли;
	КонецЦикла;     
	
	
	
	ПараметрыПроцедуры = новый Массив;          
	ПараметрыПроцедуры.Добавить(МассивСтрок); 
	ПараметрыПроцедуры.Добавить(Объект.ФизическийСклад);
	ПараметрыПроцедуры.Добавить(ЗакрываемыйМесяц);

	
	
	если ВыполнятьФоново тогда	
		пВыполнения 		= инт_ДлительныеОперации.ПараметрыВыполненияВФоне();			
		КоличествоПотоков	= 1;				
		рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработки.АРМ_ЗакрытиеМинусов.РаспровестиВиртуальныеПРМ", ПараметрыПроцедуры, пВыполнения);			
		
		Обработчик = новый ОписаниеОповещения("ПолучитьРезультатВыполненияРаспровестиВиртуальныеПРМ",ЭтотОбъект);  
		УведомленияКлиента.ПодключитьОбработчик("ПроцентВыполненияРаспровестиВиртуальныеПРМ",Обработчик);    
		
		Обработчик = новый ОписаниеОповещения("ПолучитьОповещенияФоновыеРаспровестиВиртуальныеПРМ",ЭтотОбъект);  	
		УведомленияКлиента.ПодключитьОбработчик("ОповещенияФоновыеРаспровестиВиртуальныеПРМ",Обработчик);    
	иначе                                   
		ДопПараметры = новый Структура("ВыполнятьФоново",Ложь);
		РаспровестиВыбранныеПРМНаСервере(МассивСтрок,Объект.ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры);  
		ЗаполнитьУдаляемыеВиртуальныеПРМНаСервере();
	КонецЕсли;
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура ЗаписатьОстаткиСкладаВРС(Команда)       
	
	если Обработки.АРМ_ЗакрытиеМинусов.ОстаткиСкладовЗаписаны(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц)) тогда
		Сообщить("Отстатки склада уже записаны, если вы полностью уверены, что их надо перезаписать, то удалите запись ДанныеЗакрытияМесяцаПоСкладу и нажимте кнопку ещё раз");
		Возврат;
	КонецЕсли;
	
	
	Обработки.АРМ_ЗакрытиеМинусов.ЗаписатьОстаткиСклада(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц));      
	ПроверитьЗаписьОстатковСкладаНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическийСкладПриИзменении(Элемент)
	ВремяДокументовПеренесено = Ложь;
	ВиртуальныеПРМРаспроведены = Ложь
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыйМесяцПриИзменении(Элемент)
	ВремяДокументовПеренесено = Ложь;
	ВиртуальныеПРМРаспроведены = Ложь
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбрабатывемыеДниНаСервере()  
	МассивВсехСкладов = Обработки.АРМ_ЗакрытиеМинусов.ПолучитьМассивВиртуальныхСкладов(Объект.ФизическийСклад,Истина);
	МассивТолькоВиртуальныхСкладов = Обработки.АРМ_ЗакрытиеМинусов.ПолучитьМассивВиртуальныхСкладов(Объект.ФизическийСклад,ложь);
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КалендарьДни.Дата КАК День, 
	|	ЛОЖЬ КАК МинусаЗакрыты,
	|	ЛОЖЬ КАК ИзлишкиЗабраны,
	|	ЛОЖЬ КАК Обработан
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.Ссылка.Период = &Дата2
	|	И НЕ КалендарьДни.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";     
	запрос.УстановитьПараметр("Дата2",НачалоМесяца(ЗакрываемыйМесяц));    
	Объект.ОбработанныеДни.Загрузить(запрос.Выполнить().Выгрузить()); 
	
	ЗапросМинуса = новый запрос;  
	ЗапросМинуса.УстановитьПараметр("МассивСкладов",МассивВсехСкладов);
	ЗапросМинуса.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток < 0";	
	
	
	ЗапросИзлишки = новый запрос;    
	ЗапросИзлишки.УстановитьПараметр("МассивСкладов",МассивТолькоВиртуальныхСкладов);	
	ЗапросИзлишки.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0";	
	
	
	
	МассивОбработанныхДней = новый Массив;  
	ЗначенияДанных = Обработки.АРМ_ЗакрытиеМинусов.ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц));	
	если ЗначенияДанных = Неопределено тогда
		ЗначенияДанных = новый Структура();
	КонецЕсли;                
	
	если ЗначенияДанных.Свойство("МассивОбработанныхДней") тогда
		МассивОбработанныхДней   =  ЗначенияДанных.МассивОбработанныхДней;
	КонецЕсли;
	
	
	
	Для каждого ТекСтрока из Объект.ОбработанныеДни цикл  
		ТекДень = ТекСтрока.День;
		ЗапросМинуса.УстановитьПараметр("Дата2",КонецДня(ТекДень)+1);  
		если ЗапросМинуса.Выполнить().Выбрать().Количество() = 0 тогда 
			ТекСтрока.МинусаЗакрыты = Истина;
		КонецЕсли; 
		
		ЗапросИзлишки.УстановитьПараметр("Дата2",КонецДня(ТекДень)+1);    
		если ЗапросИзлишки.Выполнить().Выбрать().Количество() = 0 тогда   
			ТекСтрока.ИзлишкиЗабраны = Истина;
		КонецЕсли; 
		
		//если ТекСтрока.ИзлишкиЗабраны и  ТекСтрока.МинусаЗакрыты тогда
		//	ТекСтрока.ДеньОбработан = Истина;
		//КонецЕсли;
		
		//если не ТекСтрока.ДеньОбработан тогда
		//	Прервать;
		//КонецЕсли;    
		если МассивОбработанныхДней.найти(ТекДень) <> Неопределено тогда  
			ТекСтрока.ДеньОбработан = Истина;
		иначе
			ТекСтрока.ДеньОбработан = ложь;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьТЧПеремещенияНаВиртуальныеСклады();    
	ЗаполнитьТЧПеремещенияСВиртуальныхСкладов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбрабатывемыеДни(Команда)
	ЗаполнитьОбрабатывемыеДниНаСервере();
КонецПроцедуры




&НаКлиенте
Процедура СоздатьПРМДляОбнуленияВиртуальныхСкладов(Команда)

	ПараметрыПроцедуры = новый Массив;          
	ПараметрыПроцедуры.Добавить(Объект.ФизическийСклад);
	ПараметрыПроцедуры.Добавить(ЗакрываемыйМесяц);  

	если ВыполнятьФоново тогда	
		пВыполнения 		= инт_ДлительныеОперации.ПараметрыВыполненияВФоне();			
		КоличествоПотоков	= 1;				
		рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработки.АРМ_ЗакрытиеМинусов.СоздатьПРМДляОбнуленияВиртуальныхСкладов", ПараметрыПроцедуры, пВыполнения);			
		
		Обработчик = новый ОписаниеОповещения("ПолучитьРезультатВыполненияПРМДляОбнуленияВиртуальныхСкладовНаСервере",ЭтотОбъект);  
		УведомленияКлиента.ПодключитьОбработчик("ПроцентВыполненияПРМДляОбнуленияВиртуальныхСкладовНаСервере",Обработчик);    
		
		Обработчик = новый ОписаниеОповещения("ПолучитьОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере",ЭтотОбъект);  	
		УведомленияКлиента.ПодключитьОбработчик("ОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере",Обработчик);    
	иначе                                   
		ДопПараметры = новый Структура("ВыполнятьФоново",Ложь);
		СоздатьПРМДляОбнуленияВиртуальныхСкладовНаСервере(Объект.ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры);
		ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов();	
	КонецЕсли;
	
КонецПроцедуры




&НаСервере 
Процедура ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов ()
		МассивПРМ = Обработки.АРМ_ЗакрытиеМинусов.ПрочитатьМассивДанныхЗакрытияМесяцаПоСкладу(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц),"МассивПРМДляОбнуленияВиртСкладов"); 

		запрос = новый запрос;
		запрос.Текст = "ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Перемещение КАК Перемещение
		|ГДЕ
		|	Перемещение.Проведен
		|	И Перемещение.Ссылка В(&МассивПРМ)";
		запрос.УстановитьПараметр("МассивПРМ",МассивПРМ);    
		МассивПРМ = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

		
		для каждого СтрМасс из МассивПРМ цикл 
			//если не СтрМасс.Проведен тогда Продолжить;КонецЕсли;
			если объект.ПеремещениеДляОбнуленияВиртуальныхСкладов.НайтиСтроки(новый Структура("Документ",СтрМасс)).количество() = 0 тогда
				СтрТЧ = объект.ПеремещениеДляОбнуленияВиртуальныхСкладов.Добавить();
				СтрТЧ.Документ = СтрМасс;   
				СтрТЧ.ВиртуальныйСклад = СтрМасс.Склад; 
			КонецЕсли;
		КонецЦикла;
КонецПроцедуры      


&НаСервере 
Процедура ЗаполнитьТЧПеремещенияНаВиртуальныеСклады ()
	МассивПРМ = Обработки.АРМ_ЗакрытиеМинусов.ПрочитатьМассивДанныхЗакрытияМесяцаПоСкладу(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц),"МассивПеремещенияНаВиртуальныеСклады"); 
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Перемещение.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Перемещение КАК Перемещение
	               |ГДЕ
	               |	Перемещение.Проведен
	               |	И Перемещение.Ссылка В(&МассивПРМ)";
	запрос.УстановитьПараметр("МассивПРМ",МассивПРМ);    
	МассивПРМ = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	для каждого СтрМасс из МассивПРМ цикл 
		//если не СтрМасс.Проведен тогда Продолжить;КонецЕсли;
		если объект.ПеремещенияНаВиртуальныеСклады.НайтиСтроки(новый Структура("Документ",СтрМасс)).количество() = 0 тогда
			СтрТЧ = объект.ПеремещенияНаВиртуальныеСклады.Добавить();
			СтрТЧ.Документ = СтрМасс;     
			СтрТЧ.День = СтрМасс.ДатаОтгрузки;
			СтрТЧ.ВиртуальныйСклад = СтрМасс.СкладПолучатель; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры        

&НаСервере 
Процедура ЗаполнитьТЧПеремещенияСВиртуальныхСкладов ()
	МассивПРМ = Обработки.АРМ_ЗакрытиеМинусов.ПрочитатьМассивДанныхЗакрытияМесяцаПоСкладу(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц),"МассивПеремещенияПеремещенияСВиртуальныхСкладов"); 

	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Перемещение.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Перемещение КАК Перемещение
	               |ГДЕ
	               |	Перемещение.Проведен
	               |	И Перемещение.Ссылка В(&МассивПРМ)";
	запрос.УстановитьПараметр("МассивПРМ",МассивПРМ);    
	МассивПРМ = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	для каждого СтрМасс из МассивПРМ цикл 
		//если не СтрМасс.Проведен тогда Продолжить;КонецЕсли;
		если объект.ПеремещенияСВиртуальныхСкладов.НайтиСтроки(новый Структура("Документ",СтрМасс)).количество() = 0 тогда
			СтрТЧ = объект.ПеремещенияСВиртуальныхСкладов.Добавить();
			СтрТЧ.Документ = СтрМасс;     
			СтрТЧ.День = СтрМасс.ДатаОтгрузки;
			СтрТЧ.ВиртуальныйСклад = СтрМасс.Склад; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры        




#Область ПромежуточныеПроцедурыДляВызоваМенеджераОбработки 

&НаСервереБезКонтекста                       
Процедура СоздатьПРМДляОбнуленияВиртуальныхСкладовНаСервере (ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры)    
	Обработки.АРМ_ЗакрытиеМинусов.СоздатьПРМДляОбнуленияВиртуальныхСкладов(ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры);  	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьПРМДляОбработкиДнейНаСервере(ФизическийСклад,МассивДней,ПропускатьПроблемныеДни,ДопПараметры)
	Обработки.АРМ_ЗакрытиеМинусов.СоздатьПРМДляВыравниванияОстатковПоДням(ФизическийСклад,МассивДней,ПропускатьПроблемныеДни,ДопПараметры);  	
КонецПроцедуры


&НаСервереБезКонтекста        
Процедура РаспровестиВыбранныеПРМНаСервере(МассивСтрок,ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры)    
	Обработки.АРМ_ЗакрытиеМинусов.РаспровестиВиртуальныеПРМ(МассивСтрок,ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры);
КонецПроцедуры


&НаСервереБезКонтекста                        
Процедура ПеренестиВремяДокументовНаСервере(МассивСтрок,СмещениеПоДате,ДопПараметры)    
	Обработки.АРМ_ЗакрытиеМинусов.ПеренестиВремяИсходящихНакладных(МассивСтрок,СмещениеПоДате,ДопПараметры);
КонецПроцедуры





#КонецОбласти



&НаСервере
Процедура ПроверитьНаличиеОстатковНаВиртСкладыНаСервере()   
	
	МассивСкладов = Обработки.АРМ_ЗакрытиеМинусов.ПолучитьМассивВиртуальныхСкладов(объект.ФизическийСклад,ложь);
	ЗапросИзлишки = новый запрос;    
	ЗапросИзлишки.УстановитьПараметр("МассивСкладов",МассивСкладов);
	ЗапросИзлишки.УстановитьПараметр("Дата2",НачалоМесяца(ЗакрываемыйМесяц)+1);
	
	ЗапросИзлишки.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0";	  
	ТЗ = ЗапросИзлишки.Выполнить().Выбрать();
	если тз.Количество() > 0 тогда
		ВиртуальныеСкладыОбнулены = ложь;
	иначе
		ВиртуальныеСкладыОбнулены = Истина;
	КонецЕсли;   
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьНаличиеОстатковНаВиртСклады(Команда)
	ПроверитьНаличиеОстатковНаВиртСкладыНаСервере();        
	ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов();

	если ВиртуальныеСкладыОбнулены тогда
		Сообщить("Остатки виртуальных складов обнулены");
	иначе
		Сообщить("Остатки виртуальных складов не обнулены");
	КонецЕсли;
КонецПроцедуры   




&НаСервере
Процедура ПроверитьЗаписьОстатковСкладаНаСервере()
	если Обработки.АРМ_ЗакрытиеМинусов.ОстаткиСкладовЗаписаны(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц)) тогда
		ОстаткиВиртуальныхСкладовНаКонецМесяцаЗафиксированы = Истина;
	иначе
		ОстаткиВиртуальныхСкладовНаКонецМесяцаЗафиксированы = ложь;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьЗаписьОстатковСклада(Команда)
	ПроверитьЗаписьОстатковСкладаНаСервере();   
	если ОстаткиВиртуальныхСкладовНаКонецМесяцаЗафиксированы тогда
		Сообщить("Остатки записаны"); 
	иначе  
		Сообщить("Остатки не записаны"); 	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПРМДляОбработкиДней(Команда)                                                   
	ПропускатьПроблемныеДни = Истина;	
	
	МассивДней								= новый Массив;    
	сч=1;          
	
	если ТолькоВыделенныеДни тогда  
		Для каждого СтрМассива Из  Элементы.ОбработанныеДни.ВыделенныеСтроки цикл   
			СтрДней =  объект.ОбработанныеДни.НайтиПоИдентификатору(СтрМассива);			
			МассивДней.Добавить(СтрДней.День);  
		КонецЦикла;	
	иначе
		для каждого СтрДней из Объект.ОбработанныеДни цикл   
			если СтрДней.ДеньОбработан тогда Продолжить;КонецЕсли;
			МассивДней.Добавить(СтрДней.День);  
			//если сч = 5 тогда
			//	Прервать;
			//КонецЕсли;   
			сч= сч+1;
			
		КонецЦикла;
		//МассивДней			= Объект.ОбработанныеДни.Выгрузить(,"День").ВыгрузитьКолонку("День"); 
	КонецЕсли;           
	
	
	
	ПараметрыПроцедуры	= новый Массив;      
	
	
	
	ПараметрыПроцедуры.Добавить(Объект.ФизическийСклад);
	ПараметрыПроцедуры.Добавить(МассивДней);     
	ПараметрыПроцедуры.Добавить(ПропускатьПроблемныеДни);     
	
	если ВыполнятьФоново тогда	
		пВыполнения 		= инт_ДлительныеОперации.ПараметрыВыполненияВФоне();			
		КоличествоПотоков	= 1;				
		рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработки.АРМ_ЗакрытиеМинусов.СоздатьПРМДляВыравниванияОстатковПоДням", ПараметрыПроцедуры, пВыполнения);			
		
		Обработчик = новый ОписаниеОповещения("ПолучитьРезультатВыполненияСоздатьПРМДляОбработкиДнейНаСервере",ЭтотОбъект);  
		УведомленияКлиента.ПодключитьОбработчик("ПроцентВыполненияСоздатьПРМДляОбработкиДнейНаСервере",Обработчик);    
		
		Обработчик = новый ОписаниеОповещения("ПолучитьОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",ЭтотОбъект);  	
		УведомленияКлиента.ПодключитьОбработчик("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",Обработчик);    
	иначе                                   
		ДопПараметры = новый Структура("ВыполнятьФоново",Ложь);
		СоздатьПРМДляОбработкиДнейНаСервере(объект.ФизическийСклад,МассивДней,ПропускатьПроблемныеДни,ДопПараметры);
		//ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов(МассивСозданныхПРМ);
		если не ТолькоВыделенныеДни тогда
			ЗаполнитьОбрабатывемыеДниНаСервере();	 
		КонецЕсли;
	КонецЕсли;
	
	

КонецПроцедуры


&НаСервере 
Процедура ЗаполнитьТЧПеремещенийВыравниванияПоДням (МассивПРМ)
	Для каждого ТекПРМ из МассивПРМ цикл 
		если ТекПРМ.Склад = Объект.ФизическийСклад тогда  
			если объект.ПеремещенияНаВиртуальныеСклады.НайтиСтроки(новый Структура("Документ",ТекПРМ)).количество() = 0 тогда   
				СтрТЧ = объект.ПеремещенияНаВиртуальныеСклады.Добавить();
				СтрТЧ.Документ = ТекПРМ;
				СтрТЧ.День = ТекПРМ.ДатаОтгрузки;
				СтрТЧ.ВиртуальныйСклад = ТекПРМ.СкладПолучатель;
			КонецЕсли;     
		иначе
			если объект.ПеремещенияСВиртуальныхСкладов.НайтиСтроки(новый Структура("Документ",ТекПРМ)).количество() = 0 тогда   
				СтрТЧ = объект.ПеремещенияСВиртуальныхСкладов.Добавить();
				СтрТЧ.Документ = ТекПРМ;
				СтрТЧ.День = ТекПРМ.ДатаОтгрузки;
				СтрТЧ.ВиртуальныйСклад = ТекПРМ.Склад;
			КонецЕсли;    	
		КонецЕсли;             
	КонецЦикла;
КонецПроцедуры      

#Область РаботаСФоновымиОповещениями 

&НаКлиенте
Процедура ПолучитьРезультатВыполненияПРМДляОбнуленияВиртуальныхСкладовНаСервере (Процент,ДополнительныеПараметры) экспорт  
	если Процент = 1000 тогда
		Процент = 100;    
		ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов();	
	КонецЕсли;
	
		ПроцентСборкаТовараНаФизСкладе = Процент;  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере (Оповещения,ДополнительныеПараметры) экспорт 
	если ТипЗнч(Оповещения) = Тип("Строка") тогда
		Сообщить(Оповещения);       
	КонецЕсли;
КонецПроцедуры   



&НаКлиенте
Процедура ПолучитьРезультатВыполненияВосстановитьОстаткиВиртуальныхСкладов (Процент,ДополнительныеПараметры) экспорт
	если Процент = 1000 тогда
		Процент = 100;    
		//ЗаполнитьУдаляемыеВиртуальныеПРМНаСервере();
	КонецЕсли;
	
	ПроцентВосстановлениеОстатков = Процент;  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов (Оповещения,ДополнительныеПараметры) экспорт 
	если ТипЗнч(Оповещения) = Тип("Строка") тогда
		Сообщить(Оповещения);       
	ИначеЕсли ТипЗнч(Оповещения) = Тип("Массив") тогда
		//ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов(Оповещения);	 
	КонецЕсли;
КонецПроцедуры   




&НаКлиенте
Процедура ПолучитьРезультатВыполненияРаспровестиВиртуальныеПРМ (Процент,ДополнительныеПараметры) экспорт    
	если Процент = 1000 тогда
		Процент = 100;    
		ЗаполнитьУдаляемыеВиртуальныеПРМНаСервере();
	КонецЕсли;
	
	ПроцентСборкаТовараНаФизСкладе = Процент;  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОповещенияФоновыеРаспровестиВиртуальныеПРМ (Оповещения,ДополнительныеПараметры) экспорт
	Сообщить(Оповещения);
КонецПроцедуры



&НаКлиенте
Процедура ПолучитьРезультатВыполненияПереносВремениДокуметов (Процент,ДополнительныеПараметры) экспорт   
	если Процент = 1000 тогда
		Процент = 100;    
		ПроверитьДатуВремяДокументовНаСервере();
	КонецЕсли;
	ПроцентВыполненияПереносВремени = Процент;  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОповещенияФоновыеПереносВремениДокументов (Оповещения,ДополнительныеПараметры) экспорт
	Сообщить(Оповещения);
КонецПроцедуры



&НаКлиенте
Процедура ПолучитьРезультатВыполненияСоздатьПРМДляОбработкиДнейНаСервере (Процент,ДополнительныеПараметры) экспорт
	
	если Процент = 1000 тогда
		Процент = 100;    
		если не ТолькоВыделенныеДни тогда
			ЗаполнитьОбрабатывемыеДниНаСервере();	 
		КонецЕсли;
	КонецЕсли;
	
	ПроцентВыравниваниеОстатковПоДням = Процент;  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере (Оповещения,ДополнительныеПараметры) экспорт 
	если ТипЗнч(Оповещения) = Тип("Строка") тогда
		Сообщить(Оповещения);       
	ИначеЕсли ТипЗнч(Оповещения) = Тип("Массив") тогда
		ЗаполнитьТЧПеремещенийВыравниванияПоДням(Оповещения);	 
	КонецЕсли;
КонецПроцедуры   





#КонецОбласти




#Область РаботаСГалочкамиФормы
&НаКлиенте
Процедура ИнвертироватьОтметкуПроблемныеДокументы(Команда)
	Для каждого СтрТЧ из Элементы.ВиртуальныеПРМкУдалению.ВыделенныеСтроки цикл     
		ПолнаяСтрока =  объект.ВиртуальныеПРМкУдалению.НайтиПоИдентификатору(СтрТЧ);
		ПолнаяСтрока.Отметка = не ПолнаяСтрока.Отметка;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ИнвертироватьОтметкуВиртуальныеПРМкУдалению(Команда)
	Для каждого СтрТЧ из Элементы.ВиртуальныеПРМкУдалению.ВыделенныеСтроки цикл     
		ПолнаяСтрока =  объект.ВиртуальныеПРМкУдалению.НайтиПоИдентификатору(СтрТЧ);
		ПолнаяСтрока.Отметка = не ПолнаяСтрока.Отметка;
	КонецЦикла;
КонецПроцедуры     

&НаСервере
Процедура ЗаполнитьТекущийХодВыполненияНаСервере()
	ПроверитьДатуВремяДокументовНаСервере();
	ПроверитьЗаписьОстатковСкладаНаСервере();
	ЗаполнитьУдаляемыеВиртуальныеПРМНаСервере(); 
	ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов();
	ПроверитьНаличиеОстатковНаВиртСкладыНаСервере();  

	ЗаполнитьТЧПеремещенияНаВиртуальныеСклады();    
	ЗаполнитьТЧПеремещенияСВиртуальныхСкладов();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущийХодВыполнения(Команда)
	ЗаполнитьТекущийХодВыполненияНаСервере(); 
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВосстановитьОстаткиВиртуальныхСкладовНаСервере(ФизическийСклад,ЗакрываемыйМесяц,МассивСозданныхПРМ,ДопПараметры)
	Обработки.АРМ_ЗакрытиеМинусов.ВосстановитьОстаткиВиртуальныхСкладов(ФизическийСклад,ЗакрываемыйМесяц,МассивСозданныхПРМ,ДопПараметры);  	
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьОстаткиВиртуальныхСкладов(Команда)  
	МассивСозданныхПРМ = новый Массив;
	ПараметрыПроцедуры = новый Массив;          
	ПараметрыПроцедуры.Добавить(Объект.ФизическийСклад);
	ПараметрыПроцедуры.Добавить(ЗакрываемыйМесяц);  
	ПараметрыПроцедуры.Добавить(МассивСозданныхПРМ);
	если ВыполнятьФоново тогда	
		пВыполнения 		= инт_ДлительныеОперации.ПараметрыВыполненияВФоне();			
		КоличествоПотоков	= 1;				
		рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработки.АРМ_ЗакрытиеМинусов.ВосстановитьОстаткиВиртуальныхСкладов", ПараметрыПроцедуры, пВыполнения);			
		
		Обработчик = новый ОписаниеОповещения("ПолучитьРезультатВыполненияВосстановитьОстаткиВиртуальныхСкладов",ЭтотОбъект);  
		УведомленияКлиента.ПодключитьОбработчик("ПроцентВыполненияВосстановитьОстаткиВиртуальныхСкладов",Обработчик);    
		
		Обработчик = новый ОписаниеОповещения("ПолучитьОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",ЭтотОбъект);  	
		УведомленияКлиента.ПодключитьОбработчик("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",Обработчик);    
	иначе                                   
		ДопПараметры = новый Структура("ВыполнятьФоново",Ложь);
		ВосстановитьОстаткиВиртуальныхСкладовНаСервере(Объект.ФизическийСклад,ЗакрываемыйМесяц,МассивСозданныхПРМ,ДопПараметры);
		//ЗаполнитьТЧПеремещениеДляОбнуленияВиртуальныхСкладов(МассивСозданныхПРМ);	
	КонецЕсли;
	
	//ПроверитьНаличиеОстатковНаВиртСкладыНаСервере();
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьОбработанныеДниНаСервере(Склад,Месяц)
	Обработки.АРМ_ЗакрытиеМинусов.ОчиститьОбработанныеДни(Склад,месяц);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОбработанныеДни(Команда)
	ОчиститьОбработанныеДниНаСервере(Объект.ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьУдаленныеПРМВиртуальныхСкладовНаСервере(Склад,Месяц)
	// Вставить содержимое обработчика.
	возврат обработки.АРМ_ЗакрытиеМинусов.ПрочитатьМассивДанныхЗакрытияМесяцаПоСкладу(Склад,Месяц,"МассивРаспроводимыхВиртуальныхПРМ");
КонецФункции


&НаКлиенте
Процедура ПрочитатьУдаленныеПРМВиртуальныхСкладов(Команда)
	МассивПРМ = ПрочитатьУдаленныеПРМВиртуальныхСкладовНаСервере(объект.ФизическийСклад,ЗакрываемыйМесяц); 
	Сообщить(СтрСоединить(МассивПРМ,символы.ПС));
КонецПроцедуры



#КонецОбласти
